krahul1605/Power-Optimized-FPGA-Implementation-of-ASCON-128/esp32_ascon_metrics.ino
#include <Arduino.h>
#include <driver/i2s.h>
#include <SPI.h>
#include <math.h>

#if defined(ARDUINO_ESP32_RELEASE_2) || ESP_ARDUINO_VERSION_MAJOR >= 2
  #define I2S_FORMAT_STD  I2S_COMM_FORMAT_STAND_I2S
#else
  #define I2S_FORMAT_STD  I2S_COMM_FORMAT_I2S
#endif

// ── Config ────────────────────────────────────────────────────────────────────
#define SAMPLE_RATE        16050
#define MAX_RECORD_SECS    3
#define CHUNK_SIZE         64
#define MAX_CHUNKS         ((SAMPLE_RATE * MAX_RECORD_SECS + CHUNK_SIZE - 1) / CHUNK_SIZE)
#define FRAME_BYTES        256
#define SPI_CLOCK_HZ       1000000

#define ASCON_WAIT_MS      30
#define MAX_RETRIES        80
#define RETRY_DELAY_MS     0

#define FSM_POLL_RETRIES   1000
#define FSM_POLL_DELAY_MS  50
#define FSM_GUARD_POLLS    2
#define FSM_GUARD_DELAY_MS 8

#define ZERO_MISO_EXTRA_WAIT_MS  25
#define ZERO_MISO_MAX_RETRIES     5

#define SPI_CS_SETUP_US    50
#define MIC_DC_ALPHA       0.945f
#define MIC_GAIN_SHIFT     21

// ── MISO/MOSI offsets ─────────────────────────────────────────────────────────
#define MISO_SENTINEL      64
#define MISO_CT_START      0
#define MISO_CT_LEN        64
#define MISO_TAG_START     65
#define MISO_TAG_LEN       16
#define MISO_NONCE_START   81
#define MISO_NONCE_LEN     16
#define MISO_KEYECHO_START 97
#define MISO_KEYECHO_LEN   16
#define POLL_KEY_START     0
#define POLL_KEY_LEN       16
#define POLL_FSM_BYTE      96
#define POLL_FIFO_BYTE     97
#define MOSI_TOTAL_CHUNKS    114
#define MOSI_TOTAL_CHUNKS_HI 115

#define FSM_ENC_READY  0xA5
#define FSM_DEC_READY  0x5A

// ── Pins ──────────────────────────────────────────────────────────────────────
#define PIN_BTN    4
#define PIN_SPI_CS 5
#define I2S_MIC    I2S_NUM_0
#define I2S_SPK    I2S_NUM_1

// ── Per-chunk encrypted packet ────────────────────────────────────────────────
struct AudioPacket {
    uint8_t ct   [CHUNK_SIZE];
    uint8_t tag  [MISO_TAG_LEN];
    uint8_t nonce[MISO_NONCE_LEN];
    uint8_t len;
    bool    valid;
};

// ── Global state ──────────────────────────────────────────────────────────────
static AudioPacket* enc_packets     = nullptr;
static uint32_t     enc_chunk_count = 0;
static uint8_t      spi_frame[FRAME_BYTES];
static uint8_t      spi_resp [FRAME_BYTES];
static uint8_t      active_key[16]  = {0};
static bool         key_valid       = false;

// pcm_pre_enc  : uint8 PCM captured after IIR filter+gain, before SPI encrypt
// pcm_post_dec : uint8 PCM received from BRAM FIFO decrypt, before I2S play
static uint8_t* pcm_pre_enc  = nullptr;
static uint8_t* pcm_post_dec = nullptr;

static uint32_t metrics_tag_ok_count     = 0;
static uint32_t metrics_chunk_drop_count = 0;

// ═══════════════════════════════════════════════════════════════════════════════
// SPI PRIMITIVES
// ═══════════════════════════════════════════════════════════════════════════════

static void spiTransact(void)
{
    SPI.beginTransaction(SPISettings(SPI_CLOCK_HZ, MSBFIRST, SPI_MODE0));
    digitalWrite(PIN_SPI_CS, LOW);
    delayMicroseconds(SPI_CS_SETUP_US);
    SPI.transferBytes(spi_frame, spi_resp, FRAME_BYTES);
    delayMicroseconds(2);
    digitalWrite(PIN_SPI_CS, HIGH);
    SPI.endTransaction();
    delayMicroseconds(50);
}

static void pollFpga(void)
{
    memset(spi_frame, 0, FRAME_BYTES);
    spiTransact();
}

static void dumpBytes(const char* label, const uint8_t* buf, int n)
{
    Serial.print(label);
    for (int i = 0; i < n; i++) Serial.printf("%02X ", buf[i]);
    Serial.println();
}

static bool isAllZero(const uint8_t* buf, int n)
{
    for (int i = 0; i < n; i++) if (buf[i]) return false;
    return true;
}

static bool tryCapturePollKey(void)
{
    if (spi_resp[MISO_SENTINEL] != 0x00) return false;
    if (isAllZero(&spi_resp[POLL_KEY_START], POLL_KEY_LEN)) return false;
    memcpy(active_key, &spi_resp[POLL_KEY_START], POLL_KEY_LEN);
    key_valid = true;
    return true;
}

static bool waitForFsmState(uint8_t expected, uint32_t chunk_idx)
{
    int attempt = 0;
    while (attempt < FSM_POLL_RETRIES) {
        pollFpga();
        uint8_t sentinel = spi_resp[MISO_SENTINEL];
        uint8_t fsm      = spi_resp[POLL_FSM_BYTE];
        if (!key_valid && sentinel == 0x00)
            if (tryCapturePollKey()) {
                Serial.print(F("[KEY] Captured: "));
                dumpBytes("", active_key, 16);
            }
        if (fsm == expected) {
            if (attempt > 0)
                Serial.printf("[FSM] chunk %u: 0x%02X confirmed attempt %d\n",
                              chunk_idx, expected, attempt);
            if (expected == FSM_ENC_READY) {
                bool guard_ok = true;
                for (int g = 0; g < FSM_GUARD_POLLS && guard_ok; g++) {
                    delay(FSM_GUARD_DELAY_MS);
                    pollFpga();
                    if (!key_valid && spi_resp[MISO_SENTINEL] == 0x00)
                        tryCapturePollKey();
                    if (spi_resp[POLL_FSM_BYTE] != expected) {
                        Serial.printf("[WARN] chunk %u: FSM dropped during guard (g=%d) → re-wait\n",
                                      chunk_idx, g);
                        guard_ok = false;
                        attempt  = 0;
                    }
                }
                if (!guard_ok) { delay(FSM_POLL_DELAY_MS); continue; }
            }
            return true;
        }
        if (attempt < 3 || attempt % 50 == 0)
            Serial.printf("[FSM] chunk %u attempt %d: sentinel=0x%02X fsm=0x%02X (want 0x%02X)\n",
                          chunk_idx, attempt, sentinel, fsm, expected);
        delay(FSM_POLL_DELAY_MS);
        attempt++;
    }
    Serial.printf("[ERR] FSM 0x%02X not reached at chunk %u\n", expected, chunk_idx);
    return false;
}

static void buildFrame(uint8_t type,
                       const uint8_t* nonce,
                       const uint8_t* dec_tag,
                       const uint8_t* payload,
                       uint8_t payload_len,
                       uint16_t total_chunks = 0)
{
    memset(spi_frame, 0, FRAME_BYTES);
    spi_frame[0] = type;
    memcpy(&spi_frame[1],  active_key, 16);
    if (nonce)   memcpy(&spi_frame[17], nonce,   16);
    if (dec_tag) memcpy(&spi_frame[33], dec_tag, 16);
    spi_frame[49] = payload_len;
    if (payload && payload_len > 0)
        memcpy(&spi_frame[50], payload, payload_len);
    if (total_chunks > 0) {
        spi_frame[MOSI_TOTAL_CHUNKS]    = (uint8_t)(total_chunks & 0xFF);
        spi_frame[MOSI_TOTAL_CHUNKS_HI] = (uint8_t)((total_chunks >> 8) & 0x03);
    }
}

