krahul1605/Power-Optimized-FPGA-Implementation-of-ASCON-128/esp32_ascon_metrics.ino
static bool retrieveResult(uint32_t chunk_idx)
{
    delay(ASCON_WAIT_MS);
    int zero_retries = 0;
    int attempt      = 0;
    while (attempt <= MAX_RETRIES) {
        pollFpga();
        if (isAllZero(spi_resp, FRAME_BYTES)) {
            if (zero_retries < ZERO_MISO_MAX_RETRIES) { zero_retries++; delay(ZERO_MISO_EXTRA_WAIT_MS); continue; }
            Serial.printf("[ERR] chunk %u: persistent all-zero MISO\n", chunk_idx);
            return false;
        }
        if (spi_resp[MISO_SENTINEL] == 0xA5) {
            if (attempt > 0) Serial.printf("[RESULT] chunk %u on attempt %d\n", chunk_idx, attempt);
            return true;
        }
        if (RETRY_DELAY_MS > 0) delay(RETRY_DELAY_MS);
        attempt++;
    }
    Serial.printf("[ERR] No result at chunk %u after %d retries\n", chunk_idx, MAX_RETRIES);
    return false;
}

static bool waitFifoNotEmpty(uint32_t chunk_idx, uint32_t max_polls = 200, uint32_t poll_delay = 0)
{
    for (uint32_t i = 0; i < max_polls; i++) {
        pollFpga();
        if (spi_resp[MISO_SENTINEL] == 0x00 && (spi_resp[POLL_FIFO_BYTE] & 0x80))
            return true;
        if (poll_delay > 0) delay(poll_delay);
    }
    Serial.printf("[ERR] chunk %u: FIFO never became non-empty\n", chunk_idx);
    return false;
}

static bool sendFifoRead(uint32_t chunk_idx, uint8_t* dst)
{
    memset(spi_frame, 0, FRAME_BYTES);
    spi_frame[0] = 0x04;
    memcpy(&spi_frame[1], active_key, 16);
    spiTransact();
    if (spi_resp[MISO_SENTINEL] == 0xA5) {
        bool tag_ok = !isAllZero(&spi_resp[MISO_TAG_START], MISO_TAG_LEN);
        if (!tag_ok) Serial.printf("[WARN] chunk %u: BRAM tag verdict FAIL\n", chunk_idx);
        memcpy(dst, &spi_resp[MISO_CT_START], CHUNK_SIZE);
        return true;
    }
    delay(2);
    pollFpga();
    if (spi_resp[MISO_SENTINEL] == 0xA5) {
        bool tag_ok = !isAllZero(&spi_resp[MISO_TAG_START], MISO_TAG_LEN);
        if (!tag_ok) Serial.printf("[WARN] chunk %u: BRAM tag verdict FAIL (retry)\n", chunk_idx);
        memcpy(dst, &spi_resp[MISO_CT_START], CHUNK_SIZE);
        return true;
    }
    Serial.printf("[ERR] FIFO rd chunk %u: no 0xA5 sentinel\n", chunk_idx);
    return false;
}

// ═══════════════════════════════════════════════════════════════════════════════
// I2S
// ═══════════════════════════════════════════════════════════════════════════════

static void initMic(void)
{
    i2s_config_t cfg = {
        .mode                 = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX),
        .sample_rate          = SAMPLE_RATE,
        .bits_per_sample      = I2S_BITS_PER_SAMPLE_32BIT,
        .channel_format       = I2S_CHANNEL_FMT_ONLY_LEFT,
        .communication_format = I2S_FORMAT_STD,
        .intr_alloc_flags     = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count        = 16,
        .dma_buf_len          = 128,
        .use_apll             = true,
        .fixed_mclk           = 0
    };
    i2s_pin_config_t pins = {
        .mck_io_num   = I2S_PIN_NO_CHANGE,
        .bck_io_num   = 26, .ws_io_num = 25,
        .data_out_num = I2S_PIN_NO_CHANGE, .data_in_num = 22
    };
    ESP_ERROR_CHECK(i2s_driver_install(I2S_MIC, &cfg, 0, NULL));
    ESP_ERROR_CHECK(i2s_set_pin(I2S_MIC, &pins));
    i2s_zero_dma_buffer(I2S_MIC);
}

static void initSpeaker(void)
{
    i2s_config_t cfg = {
        .mode                 = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX),
        .sample_rate          = SAMPLE_RATE,
        .bits_per_sample      = I2S_BITS_PER_SAMPLE_32BIT,
        .channel_format       = I2S_CHANNEL_FMT_ONLY_LEFT,
        .communication_format = I2S_FORMAT_STD,
        .intr_alloc_flags     = ESP_INTR_FLAG_LEVEL1,
        .dma_buf_count        = 8,
        .dma_buf_len          = 128,
        .use_apll             = true,
        .tx_desc_auto_clear   = true,
        .fixed_mclk           = 0
    };
    i2s_pin_config_t pins = {
        .mck_io_num   = I2S_PIN_NO_CHANGE,
        .bck_io_num   = 27, .ws_io_num = 14,
        .data_out_num = 13, .data_in_num = I2S_PIN_NO_CHANGE
    };
    ESP_ERROR_CHECK(i2s_driver_install(I2S_SPK, &cfg, 0, NULL));
    ESP_ERROR_CHECK(i2s_set_pin(I2S_SPK, &pins));
    i2s_zero_dma_buffer(I2S_SPK);
}

static void sendEndOfSession(uint16_t total_chunks = 0)
{
    memset(spi_frame, 0, FRAME_BYTES);
    spi_frame[0] = 0x05;
    memcpy(&spi_frame[1], active_key, 16);
    spi_frame[MOSI_TOTAL_CHUNKS]    = (uint8_t)(total_chunks & 0xFF);
    spi_frame[MOSI_TOTAL_CHUNKS_HI] = (uint8_t)((total_chunks >> 8) & 0x03);
    spiTransact();
    Serial.println(F("[ENC] End-of-session frame sent (cmd 0x05)."));
}

// ═══════════════════════════════════════════════════════════════════════════════
// METRICS
// ═══════════════════════════════════════════════════════════════════════════════

#define FFT_LEN 256

static void fft256(float* re, float* im)
{
    for (int i = 1, j = 0; i < FFT_LEN; i++) {
        int bit = FFT_LEN >> 1;
        for (; j & bit; bit >>= 1) j ^= bit;
        j ^= bit;
        if (i < j) {
            float tr = re[i]; re[i] = re[j]; re[j] = tr;
            float ti = im[i]; im[i] = im[j]; im[j] = ti;
        }
    }
    for (int len = 2; len <= FFT_LEN; len <<= 1) {
        float ang = -2.0f * (float)M_PI / (float)len;
        float wRe = cosf(ang), wIm = sinf(ang);
        for (int i = 0; i < FFT_LEN; i += len) {
            float curRe = 1.0f, curIm = 0.0f;
            for (int k = 0; k < len / 2; k++) {
                float uRe = re[i+k],       uIm = im[i+k];
                float vRe = re[i+k+len/2], vIm = im[i+k+len/2];
                float tvRe = vRe*curRe - vIm*curIm;
                float tvIm = vRe*curIm + vIm*curRe;
                re[i+k]       = uRe + tvRe;  im[i+k]       = uIm + tvIm;
                re[i+k+len/2] = uRe - tvRe;  im[i+k+len/2] = uIm - tvIm;
                float nextRe = curRe*wRe - curIm*wIm;
                float nextIm = curRe*wIm + curIm*wRe;
                curRe = nextRe; curIm = nextIm;
            }
        }
    }
}

static void powerSpectrum(const uint8_t* samples, uint32_t n_samples, float* ps)
{
    static float re[FFT_LEN], im[FFT_LEN];
    uint32_t use = (n_samples >= FFT_LEN) ? FFT_LEN : n_samples;
    for (int i = 0; i < FFT_LEN; i++) {
        float w = 0.5f * (1.0f - cosf(2.0f*(float)M_PI*i / (FFT_LEN-1)));
        float s = (i < (int)use) ? ((float)(int8_t)(samples[i] - 128)) : 0.0f;
        re[i] = s * w;
        im[i] = 0.0f;
    }
    fft256(re, im);
    for (int k = 0; k < FFT_LEN/2; k++) {
        float mag2 = re[k]*re[k] + im[k]*im[k];
        ps[k] = 10.0f * log10f(mag2 + 1e-6f);
    }
}

static void computeMetrics(void)
{
    if (!pcm_pre_enc || !pcm_post_dec || enc_chunk_count == 0) {
        Serial.println(F("[METRICS] No data."));
        return;
    }

    uint32_t total_samples = enc_chunk_count * CHUNK_SIZE;

    // ── Step 1: Wide cross-correlation to find true lag ────────────────────
    // Search ±256 samples. XCORR_MAX_LAG=64 was the ceiling AND the answer,
    // so the old code never saw the real lag. The lag is structural (one
    // CHUNK_SIZE = FPGA pipeline delay) and is expected/harmless.
    uint32_t xcorr_samples = (total_samples > 16384) ? 16384 : total_samples;
    const int32_t WIDE_LAG = 256;

    float    best_r   = -2.0f;
    int32_t  best_lag = 0;
    {
        double sumA = 0, sumB = 0;
        for (uint32_t i = 0; i < xcorr_samples; i++) {
            sumA += (int8_t)(pcm_pre_enc[i]  - 128);
            sumB += (int8_t)(pcm_post_dec[i] - 128);
        }
        float meanA = (float)(sumA / xcorr_samples);
        float meanB = (float)(sumB / xcorr_samples);

        double varA = 0, varB = 0;
        for (uint32_t i = 0; i < xcorr_samples; i++) {
            float da = (float)(int8_t)(pcm_pre_enc[i]  - 128) - meanA;
            float db = (float)(int8_t)(pcm_post_dec[i] - 128) - meanB;
            varA += da * da;
            varB += db * db;
        }
        float norm = sqrtf((float)varA * (float)varB);

        for (int32_t lag = -WIDE_LAG; lag <= WIDE_LAG; lag++) {
            double acc = 0;
            for (uint32_t i = 0; i < xcorr_samples; i++) {
                int32_t j = (int32_t)i + lag;
                if (j < 0 || j >= (int32_t)xcorr_samples) continue;
                float da = (float)(int8_t)(pcm_pre_enc[i]  - 128) - meanA;
                float db = (float)(int8_t)(pcm_post_dec[j] - 128) - meanB;
                acc += da * db;
            }
            float r = (norm < 1e-6f) ? 0.0f : (float)acc / norm;
            if (r > best_r) { best_r = r; best_lag = lag; }
        }
    }

    // ── Step 2: Compute aligned window ────────────────────────────────────
    // pre[i]  corresponds to  post[i + best_lag]
    // Only the overlapping region is valid for RMSE/SNR/LSD.
    int32_t  lag              = best_lag;
    uint32_t align_start_pre  = (lag >= 0) ? 0            : (uint32_t)(-lag);
    uint32_t align_start_post = (lag >= 0) ? (uint32_t)lag : 0;
    uint32_t lag_abs          = (lag >= 0) ? (uint32_t)lag : (uint32_t)(-lag);
    uint32_t align_n          = (lag_abs < total_samples) ? (total_samples - lag_abs) : 0;

    // ── Step 3: DC offset over aligned region ─────────────────────────────
    double sum_pre = 0, sum_post = 0;
    for (uint32_t i = 0; i < align_n; i++) {
        sum_pre  += (int8_t)(pcm_pre_enc [align_start_pre  + i] - 128);
        sum_post += (int8_t)(pcm_post_dec[align_start_post + i] - 128);
    }
    float dc_pre  = align_n ? (float)(sum_pre  / align_n) : 0.0f;
    float dc_post = align_n ? (float)(sum_post / align_n) : 0.0f;
    float dc_corr = dc_pre - dc_post;

