krahul1605/Power-Optimized-FPGA-Implementation-of-ASCON-128/esp32_ascon_metrics.ino
    // ── Step 4: RMSE (aligned + DC-corrected) ─────────────────────────────
    double mse = 0.0;
    for (uint32_t i = 0; i < align_n; i++) {
        float s    = (float)(int8_t)(pcm_pre_enc [align_start_pre  + i] - 128);
        float d    = (float)(int8_t)(pcm_post_dec[align_start_post + i] - 128) + dc_corr;
        float diff = s - d;
        mse += diff * diff;
    }
    float rmse = align_n ? sqrtf((float)(mse / align_n)) : 0.0f;

    // ── Step 5: SNR (aligned + DC-corrected) ──────────────────────────────
    double sig_power = 0.0, noise_power = 0.0;
    for (uint32_t i = 0; i < align_n; i++) {
        float s = (float)(int8_t)(pcm_pre_enc [align_start_pre  + i] - 128);
        float d = (float)(int8_t)(pcm_post_dec[align_start_post + i] - 128) + dc_corr;
        sig_power   += s * s;
        noise_power += (s - d) * (s - d);
    }
    float snr_db = (noise_power < 1e-6) ? 99.9f
                 : 10.0f * log10f((float)(sig_power / noise_power));

    // ── Step 6: LSD (aligned — must match RMSE window) ────────────────────
    // Previously called on full unaligned buffers → LSD≈10 dB even when
    // RMSE=0, because the FFT sees a phase-shifted copy of the same signal.
    // Fix: pass the lag-aligned pointers and aligned length.
    static float ps_pre[FFT_LEN/2], ps_post[FFT_LEN/2];
    powerSpectrum(pcm_pre_enc  + align_start_pre,  align_n, ps_pre);
    powerSpectrum(pcm_post_dec + align_start_post, align_n, ps_post);
    double lsd_sum = 0.0;
    for (int k = 0; k < FFT_LEN/2; k++) {
        float d = ps_pre[k] - ps_post[k];
        lsd_sum += d * d;
    }
    float lsd_db = sqrtf((float)(lsd_sum / (FFT_LEN/2)));

    float tag_pct  = 100.0f * metrics_tag_ok_count    / (float)enc_chunk_count;
    float drop_pct = 100.0f * metrics_chunk_drop_count / (float)enc_chunk_count;

    Serial.println(F("================================================"));
    Serial.println(F("  ASCON-128 AUDIO METRICS"));
    Serial.println(F("================================================"));
    Serial.printf("[METRICS] Samples     : %u  (%.2f s)\n",
                  total_samples, (float)total_samples / SAMPLE_RATE);
    Serial.printf("[METRICS] DC pre/post : %.2f / %.2f  (correction=%.2f)\n",
                  dc_pre, dc_post, dc_corr);
    Serial.printf("[METRICS] XCORR_PEAK  : %.4f  (1.0 = identical waveform)\n", best_r);
    Serial.printf("[METRICS] XCORR_LAG   : %d samples  (one CHUNK_SIZE = FPGA pipeline delay, expected)\n", (int)lag);
    Serial.printf("[METRICS] Aligned N   : %u samples\n", align_n);
    Serial.printf("[METRICS] RMSE        : %.4f  (0 = perfect, >10 = audible)\n", rmse);
    Serial.printf("[METRICS] SNR         : %.2f dB  (>40 = transparent, <10 = degraded)\n", snr_db);
    Serial.printf("[METRICS] LSD         : %.2f dB  (<2 = perceptually clean, >8 = noticeable)\n", lsd_db);
    Serial.printf("[METRICS] TAG_OK      : %u / %u  (%.1f%%)\n",
                  metrics_tag_ok_count, enc_chunk_count, tag_pct);
    Serial.printf("[METRICS] CHUNK_DROP  : %u / %u  (%.1f%%)\n",
                  metrics_chunk_drop_count, enc_chunk_count, drop_pct);
    Serial.println(F("------------------------------------------------"));
    Serial.printf("[METRICS] RMSE=%.4f SNR=%.2f LSD=%.2f XCORR=%.4f XCORR_LAG=%d TAG_OK=%u/%u CHUNK_DROP=%u/%u\n",
                  rmse, snr_db, lsd_db, best_r, (int)lag,
                  metrics_tag_ok_count, enc_chunk_count,
                  metrics_chunk_drop_count, enc_chunk_count);
    Serial.println(F("================================================"));
}

// ═══════════════════════════════════════════════════════════════════════════════
// REAL-TIME ENCRYPT PIPELINE
// ═══════════════════════════════════════════════════════════════════════════════

static bool recordAndEncryptRealtime(void)
{
    if (!key_valid) {
        Serial.println(F("[ERR] No active key."));
        return false;
    }

    Serial.print(F("[ENC] Recording + encrypting. Key: "));
    dumpBytes("", active_key, 16);
    Serial.println(F("[ENC] Release button to stop (up to 3 s)."));

    enc_chunk_count = 0;
    if (pcm_pre_enc)
        memset(pcm_pre_enc, 0x80, (size_t)MAX_CHUNKS * CHUNK_SIZE);

    uint32_t total_samples = 0;
    const uint32_t max_samples = (uint32_t)SAMPLE_RATE * MAX_RECORD_SECS;
    const uint8_t enc_total_placeholder = 0xFF;

    int32_t dma_buf[CHUNK_SIZE * 2];
    float   dc_filter_x = 0.0f;
    float   dc_filter_y = 0.0f;

    uint8_t  pcm8_pending[CHUNK_SIZE];
    uint8_t  n_pending        = 0;
    bool     has_pending      = false;

    uint32_t pending_chunk_idx = 0;
    uint8_t  pcm8_for_metrics[CHUNK_SIZE];

    while (true) {
        bool button_held = (digitalRead(PIN_BTN) == LOW);
        bool limit_hit   = (enc_chunk_count >= MAX_CHUNKS ||
                            total_samples   >= max_samples);

        // Step 1: Read next I2S chunk
        uint8_t pcm8_new[CHUNK_SIZE] = {0};
        uint8_t n_new = 0;

        if (button_held && !limit_hit) {
            size_t bytes_read = 0;
            i2s_read(I2S_MIC, dma_buf, sizeof(dma_buf), &bytes_read, portMAX_DELAY);
            uint32_t n_smp = (bytes_read / sizeof(int32_t)) / 2;
            if (n_smp > 0) {
                uint32_t remaining = max_samples - total_samples;
                if (n_smp > remaining)  n_smp = remaining;
                if (n_smp > CHUNK_SIZE) n_smp = CHUNK_SIZE;
                for (uint32_t i = 0; i < n_smp; i++) {
                    float raw_f   = (float)(int32_t)dma_buf[i * 2];
                    float filtered = raw_f - dc_filter_x + MIC_DC_ALPHA * dc_filter_y;
                    dc_filter_x   = raw_f;
                    dc_filter_y   = filtered;
                    int32_t scaled = (int32_t)(filtered) >> MIC_GAIN_SHIFT;
                    if (scaled >  127) scaled =  127;
                    if (scaled < -128) scaled = -128;
                    pcm8_new[i] = (uint8_t)((int8_t)scaled + 128);
                }
                n_new = (uint8_t)n_smp;
            }
        }

