krahul1605/Power-Optimized-FPGA-Implementation-of-ASCON-128/esp32_ascon_metrics.ino
        // Step 2: Collect ASCON result for the previous chunk
        if (has_pending) {
            bool ok = false;
            int zero_retries = 0;
            for (int attempt = 0; attempt <= MAX_RETRIES; attempt++) {
                pollFpga();
                if (isAllZero(spi_resp, FRAME_BYTES)) {
                    if (zero_retries < ZERO_MISO_MAX_RETRIES) {
                        zero_retries++;
                        delay(ZERO_MISO_EXTRA_WAIT_MS);
                        continue;
                    }
                    Serial.printf("[ERR] chunk %u: all-zero MISO\n", enc_chunk_count);
                    break;
                }
                if (spi_resp[MISO_SENTINEL] == 0xA5) { ok = true; break; }
            }

            if (!ok) {
                sendEndOfSession((uint16_t)enc_chunk_count);
                return false;
            }

            AudioPacket& pkt = enc_packets[enc_chunk_count];
            memset(&pkt, 0, sizeof(AudioPacket));
            memcpy(pkt.ct,    &spi_resp[MISO_CT_START],    MISO_CT_LEN);
            memcpy(pkt.tag,   &spi_resp[MISO_TAG_START],   MISO_TAG_LEN);
            memcpy(pkt.nonce, &spi_resp[MISO_NONCE_START], MISO_NONCE_LEN);
            pkt.len   = n_pending;
            pkt.valid = !isAllZero(pkt.nonce, MISO_NONCE_LEN);
            if (!pkt.valid)
                Serial.printf("[WARN] chunk %u: all-zero nonce\n", enc_chunk_count);
            if (memcmp(&spi_resp[MISO_KEYECHO_START], active_key, 16) != 0) {
                Serial.printf("[WARN] chunk %u: key echo mismatch!\n", enc_chunk_count);
                pkt.valid = false;
            }

            total_samples += n_pending;

            if (pcm_pre_enc && pending_chunk_idx < MAX_CHUNKS) {
                uint8_t* dst = pcm_pre_enc + (pending_chunk_idx * CHUNK_SIZE);
                memcpy(dst, pcm8_for_metrics, n_pending);
                if (n_pending < CHUNK_SIZE)
                    memset(dst + n_pending, 0x80, CHUNK_SIZE - n_pending);
            }

            enc_chunk_count++;
            has_pending = false;

            if (enc_chunk_count % 50 == 0 || enc_chunk_count == 1)
                Serial.printf("[ENC] Chunk %u OK (%.2f s)\n",
                              enc_chunk_count, (float)total_samples / SAMPLE_RATE);
        }

        // Step 3: Send the new chunk
        if (n_new > 0) {
            memcpy(pcm8_pending, pcm8_new, n_new);
            n_pending = n_new;
            pending_chunk_idx = enc_chunk_count;
            memcpy(pcm8_for_metrics, pcm8_new, n_new);

            buildFrame(0x01, nullptr, nullptr, pcm8_new, n_new, enc_total_placeholder);
            spiTransact();
            has_pending = true;
        }

        // Step 4: Exit conditions
        if (!button_held && !has_pending) break;
        if (limit_hit    && !has_pending) break;
    }

    // Flush the last in-flight chunk
    if (has_pending) {
        bool ok = false;
        int zero_retries = 0;
        for (int attempt = 0; attempt <= MAX_RETRIES; attempt++) {
            pollFpga();
            if (isAllZero(spi_resp, FRAME_BYTES)) {
                if (zero_retries < ZERO_MISO_MAX_RETRIES) {
                    zero_retries++;
                    delay(ZERO_MISO_EXTRA_WAIT_MS);
                    continue;
                }
                break;
            }
            if (spi_resp[MISO_SENTINEL] == 0xA5) { ok = true; break; }
        }
        if (ok) {
            AudioPacket& pkt = enc_packets[enc_chunk_count];
            memset(&pkt, 0, sizeof(AudioPacket));
            memcpy(pkt.ct,    &spi_resp[MISO_CT_START],    MISO_CT_LEN);
            memcpy(pkt.tag,   &spi_resp[MISO_TAG_START],   MISO_TAG_LEN);
            memcpy(pkt.nonce, &spi_resp[MISO_NONCE_START], MISO_NONCE_LEN);
            pkt.len   = n_pending;
            pkt.valid = !isAllZero(pkt.nonce, MISO_NONCE_LEN);
            if (pcm_pre_enc && pending_chunk_idx < MAX_CHUNKS) {
                uint8_t* dst = pcm_pre_enc + (pending_chunk_idx * CHUNK_SIZE);
                memcpy(dst, pcm8_for_metrics, n_pending);
                if (n_pending < CHUNK_SIZE)
                    memset(dst + n_pending, 0x80, CHUNK_SIZE - n_pending);
            }
            total_samples += n_pending;
            enc_chunk_count++;
        }
        has_pending = false;
    }

    sendEndOfSession((uint16_t)enc_chunk_count);
    Serial.printf("[ENC] Done. %u chunks, %.2f s.\n",
                  enc_chunk_count, (float)(enc_chunk_count * CHUNK_SIZE) / SAMPLE_RATE);
    Serial.println(F("================================================"));
    Serial.println(F("  Encryption complete."));
    Serial.printf("  Total chunks: %u\n", enc_chunk_count);
    Serial.println(F("  PuTTY: press [4], type key, TAP button."));
    Serial.println(F("================================================"));
    return true;
}

// ═══════════════════════════════════════════════════════════════════════════════
// DECRYPT + PLAY
// ═══════════════════════════════════════════════════════════════════════════════

static void decryptAndPlay(void)
{
    if (enc_chunk_count == 0) {
        Serial.println(F("[PLAY] No encrypted audio. Record first."));
        return;
    }

    Serial.println(F("[DEC] Waiting for FPGA dec-ready (0x5A)..."));
    Serial.println(F("      Press [4] in PuTTY and type the key now."));

    key_valid = false;
    if (!waitForFsmState(FSM_DEC_READY, 0)) {
        Serial.println(F("[ERR] FPGA dec-ready timeout."));
        return;
    }
    if (!key_valid) {
        for (int i = 0; i < 20 && !key_valid; i++) {
            delay(30); pollFpga();
            if (spi_resp[MISO_SENTINEL] == 0x00) tryCapturePollKey();
        }
    }
    if (!key_valid) {
        Serial.println(F("[ERR] Cannot read key. Check PuTTY [4] + key."));
        return;
    }

    Serial.print(F("[DEC] Key: "));
    dumpBytes("", active_key, 16);
    Serial.printf("[DEC] Decrypting + streaming %u chunks via BRAM FIFO.\n", enc_chunk_count);

    const uint16_t dec_total = (uint16_t)enc_chunk_count;
    uint8_t  pt_chunk[CHUNK_SIZE];
    uint32_t tag_fail_count = 0;
    uint32_t skip_count     = 0;
    uint32_t total_played   = 0;

    metrics_tag_ok_count     = 0;
    metrics_chunk_drop_count = 0;
    if (pcm_post_dec)
        memset(pcm_post_dec, 0x80, (size_t)MAX_CHUNKS * CHUNK_SIZE);

    i2s_zero_dma_buffer(I2S_SPK);

