krahul1605/Power-Optimized-FPGA-Implementation-of-ASCON-128/esp32_ascon_metrics.ino
    for (uint32_t ci = 0; ci < enc_chunk_count; ci++) {

        AudioPacket& pkt = enc_packets[ci];
        bool chunk_ok  = true;
        bool is_silence = false;

        if (!pkt.valid) {
            Serial.printf("[SKIP] chunk %u: invalid packet\n", ci);
            skip_count++;
            metrics_chunk_drop_count++;
            memset(pt_chunk, 0x80, pkt.len ? pkt.len : CHUNK_SIZE);
            is_silence = true;
            chunk_ok   = false;
            goto play_chunk;
        }

        // Step A: Send 0x02 decrypt frame
        buildFrame(0x02, pkt.nonce, pkt.tag, pkt.ct, CHUNK_SIZE, dec_total);
        spiTransact();

        // Step B: Poll MISO[97] bit[7] = fifo_not_empty
        if (!waitFifoNotEmpty(ci, 200, 0)) {
            Serial.printf("[ERR] chunk %u: FIFO timeout, using silence\n", ci);
            tag_fail_count++;
            metrics_chunk_drop_count++;
            memset(pt_chunk, 0x80, CHUNK_SIZE);
            is_silence = true;
            chunk_ok   = false;
            goto play_chunk;
        }

        // Step C: Send cmd 0x04 — FIFO read
        if (!sendFifoRead(ci, pt_chunk)) {
            tag_fail_count++;
            metrics_chunk_drop_count++;
            memset(pt_chunk, 0x80, CHUNK_SIZE);
            is_silence = true;
            chunk_ok   = false;
            if (tag_fail_count > 5) {
                Serial.println(F("[ERR] Too many FIFO read failures, aborting."));
                computeMetrics();
                return;
            }
            goto play_chunk;
        }

        metrics_tag_ok_count++;

        if (ci < 3) {
            Serial.printf("[DBG] chunk %u pt_chunk: ", ci);
            dumpBytes("", pt_chunk, 16);
        }

        play_chunk:
        {
            if (pcm_post_dec && ci < MAX_CHUNKS) {
                uint8_t* dst = pcm_post_dec + (ci * CHUNK_SIZE);
                memcpy(dst, pt_chunk, CHUNK_SIZE);
            }

            uint8_t n = pkt.valid ? pkt.len : (uint8_t)CHUNK_SIZE;
            int32_t tmp[CHUNK_SIZE * 2];
            for (uint8_t i = 0; i < n; i++) {
                int32_t sample = (int32_t)((int8_t)(pt_chunk[i] - 128)) << 24;
                tmp[i * 2]     = sample;
                tmp[i * 2 + 1] = 0;
            }
            size_t bw = 0;
            i2s_write(I2S_SPK, tmp, (size_t)n * 2 * sizeof(int32_t), &bw, portMAX_DELAY);
            total_played += n;

            if ((ci + 1) % 50 == 0 || ci == 0)
                Serial.printf("[DEC] Chunk %u OK (%.2f s)\n",
                              ci + 1, (float)total_played / SAMPLE_RATE);

            (void)chunk_ok; (void)is_silence;
        }
    }

    Serial.printf("[PLAY] Done. %.2f s played. tag_fails=%u skipped=%u / %u chunks\n",
                  (float)total_played / SAMPLE_RATE,
                  tag_fail_count, skip_count, enc_chunk_count);
    if (tag_fail_count == 0 && skip_count == 0)
        Serial.println(F("[PLAY] All chunks OK — BRAM FIFO decrypt pipeline."));

    computeMetrics();
}

// ═══════════════════════════════════════════════════════════════════════════════
// SETUP
// ═══════════════════════════════════════════════════════════════════════════════

void setup(void)
{
    Serial.begin(115200);
    delay(500);

    Serial.println(F("\n================================================"));
    Serial.println(F("  ASCON-128 Real-Time Audio Encryption"));
    Serial.println(F("  BRAM FIFO Decrypt / Real-Time Record"));
    Serial.println(F("  + PCM Capture & Quality Metrics"));
    Serial.println(F("================================================"));
    Serial.println(F("  ENCRYPT: PuTTY [3] + key → HOLD button"));
    Serial.println(F("  DECRYPT: PuTTY [4] + key → TAP button"));
    Serial.println(F("  METRICS printed automatically after decrypt"));
    Serial.println(F("================================================\n"));

    enc_packets = (AudioPacket*)malloc(MAX_CHUNKS * sizeof(AudioPacket));
    if (!enc_packets) {
        Serial.println(F("[FATAL] malloc failed for enc_packets"));
        while (true) delay(1000);
    }
    memset(enc_packets, 0, MAX_CHUNKS * sizeof(AudioPacket));

    size_t pcm_buf_size = (size_t)MAX_CHUNKS * CHUNK_SIZE;

    pcm_pre_enc = (uint8_t*)malloc(pcm_buf_size);
    if (!pcm_pre_enc) {
        Serial.println(F("[FATAL] malloc failed for pcm_pre_enc"));
        while (true) delay(1000);
    }
    memset(pcm_pre_enc, 0x80, pcm_buf_size);

    pcm_post_dec = (uint8_t*)malloc(pcm_buf_size);
    if (!pcm_post_dec) {
        Serial.println(F("[FATAL] malloc failed for pcm_post_dec"));
        while (true) delay(1000);
    }
    memset(pcm_post_dec, 0x80, pcm_buf_size);

    uint32_t enc_size = (uint32_t)MAX_CHUNKS * sizeof(AudioPacket);
    Serial.printf("[MEM] enc_packets  : %u KB\n", enc_size / 1024);
    Serial.printf("[MEM] pcm_pre_enc  : %u KB\n", (uint32_t)pcm_buf_size / 1024);
    Serial.printf("[MEM] pcm_post_dec : %u KB\n", (uint32_t)pcm_buf_size / 1024);
    Serial.printf("[MEM] free heap    : %u KB\n", ESP.getFreeHeap() / 1024);
    Serial.printf("[CFG] MAX_CHUNKS=%u  CHUNK_SIZE=%u  SAMPLE_RATE=%u\n",
                  MAX_CHUNKS, CHUNK_SIZE, SAMPLE_RATE);

    pinMode(PIN_BTN,    INPUT_PULLUP);
    pinMode(PIN_SPI_CS, OUTPUT);
    digitalWrite(PIN_SPI_CS, HIGH);

    SPI.begin();
    initSpeaker();
    initMic();
    Serial.println(F("[OK] Ready."));
}

// ═══════════════════════════════════════════════════════════════════════════════
// LOOP
// ═══════════════════════════════════════════════════════════════════════════════

void loop(void)
{
    if (digitalRead(PIN_BTN) != LOW) return;
    delay(20);
    if (digitalRead(PIN_BTN) != LOW) return;

    uint32_t press_start = millis();
    while (digitalRead(PIN_BTN) == LOW && (millis() - press_start) < 300)
        delay(5);

    if (digitalRead(PIN_BTN) == LOW) {
        // HOLD → encrypt
        Serial.println(F("\n[BTN] HOLD — record + encrypt."));
        Serial.println(F("[ENC] Waiting for FPGA enc-ready (0xA5)..."));
        Serial.println(F("      Press [3] in PuTTY and type 16-char key NOW."));

        key_valid = false;
        if (!waitForFsmState(FSM_ENC_READY, 0)) {
            Serial.println(F("[ERR] FPGA enc-ready timeout."));
            while (digitalRead(PIN_BTN) == LOW) delay(10);
            return;
        }
        if (!key_valid) {
            for (int i = 0; i < 20 && !key_valid; i++) {
                delay(30); pollFpga();
                if (spi_resp[MISO_SENTINEL] == 0x00)
                    if (tryCapturePollKey()) {
                        Serial.print(F("[KEY] Captured: "));
                        dumpBytes("", active_key, 16);
                    }
            }
        }
        if (!key_valid) {
            Serial.println(F("[ERR] Cannot read key. Check PuTTY [3] + key."));
            while (digitalRead(PIN_BTN) == LOW) delay(10);
            return;
        }
        if (digitalRead(PIN_BTN) != LOW) {
            Serial.println(F("[WARN] Button released — cancelled."));
            return;
        }

        enc_chunk_count = 0;
        recordAndEncryptRealtime();

    } else {
        // TAP → decrypt + metrics
        Serial.println(F("\n[BTN] TAP — decrypt + play (BRAM FIFO) + metrics."));
        if (enc_chunk_count == 0) {
            Serial.println(F("[ERR] No encrypted data. HOLD to record first."));
            return;
        }
        decryptAndPlay();
    }
}